{
  "backend/main.mo": "Defines clinic configs, patient submissions, user profiles, and access control logic with multiple data types and authorization checks.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to impacted source files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Provides prewritten 1–2 sentence summaries for all frontend source files.",
  "frontend/index.css": "Defines global Tailwind layers and extensive OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider and Toaster components.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states, auto-retry behavior, and patient‑page labeling rules.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first‑time authenticated users to save their profile name, with validation and loading states.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard enforcing authentication, showing a medical‑team access screen, and injecting profile setup when logged in.",
  "frontend/src/components/dashboard/DashboardFiltersBar.tsx": "Search and date filter UI component with icons and styled inputs for dashboard filtering.",
  "frontend/src/components/dashboard/ExportButton.tsx": "Exports filtered patient submissions to a CSV file using parsed context fields.",
  "frontend/src/components/dashboard/SubmissionsTable.tsx": "Displays a list of patient submissions with basic details and selection handling.",
  "frontend/src/components/forms/FormSectionCard.tsx": "Styled container component for grouping form sections.",
  "frontend/src/components/forms/RequiredMarker.tsx": "Renders a red asterisk indicating a required field.",
  "frontend/src/components/layout/AppFooter.tsx": "Shows footer with copyright and a referral link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the navigation header with branding, login, and patient/team view switching.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper including header, main content area, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useClinicTeam.ts": "Provides hooks to fetch and update clinic team member lists via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Minimal helper exposing actor query state for compatibility.",
  "frontend/src/hooks/useSubmissions.ts": "Hooks for fetching, submitting, and updating patient submissions through the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving the current user's profile via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styling with light/dark theme variables and animations.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays all patient submissions with search, date filtering, export, and navigation to team view.",
  "frontend/src/pages/ExamSuccessPage.tsx": "Shows exam completion confirmation, extracts patient name, and links to Google Maps for reviews.",
  "frontend/src/pages/PatientFormPage.tsx": "Handles patient intake form submission, builds a submission payload, and navigates to a success page.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Simple confirmation page shown after a registration is submitted.",
  "frontend/src/pages/TeamManagementPage.tsx": "Loads a selected patient submission, extracts fields, allows medical updates, and saves changes via updateSubmission.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-backed values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, typography, and plugin setup.",
  "project_state.json": "Stores project state, requirements, architectural notes, and known issues for rebuilding the app using IC stack while preserving existing flows. Includes feature definitions, access rules, and a noted form submission failure."
}