{
  "backend/main.mo": "Defines data models and core actor logic for clinics, patient submissions, professionals, and user profiles with access‑controlled CRUD operations.",
  "feature_evidence.json": "Lists feature evidence records mapping product requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence descriptions of many frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light and dark mode color systems and base styling.",
  "frontend/index.html": "HTML entrypoint that loads the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up the TanStack Router routes, theme provider, and toast system, including protected medical‑team routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with conditional visibility and patient‑page‑specific labeling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting authenticated users to enter their name on first login and saving the profile.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Guards medical‑team pages, showing a restricted‑access screen when unauthenticated and loading the profile dialog when authenticated.",
  "frontend/src/components/dashboard/DashboardFiltersBar.tsx": "Provides search and date filtering inputs for the dashboard submissions list.",
  "frontend/src/components/dashboard/ExportButton.tsx": "Exports patient submissions to a CSV file using extracted fields from submission context.",
  "frontend/src/components/dashboard/SubmissionsTable.tsx": "Displays a list of patient submissions with extracted summary fields and supports selection.",
  "frontend/src/components/forms/FormSectionCard.tsx": "A styled card wrapper component for form sections.",
  "frontend/src/components/forms/RequiredMarker.tsx": "Renders a red asterisk indicating a required field.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the app footer with branding, current year, and link attribution.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the header with navigation, logo, and role-based view switching.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the global layout shell including header, main content, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to Internet Identity and handles query invalidation.",
  "frontend/src/hooks/useClinicTeam.ts": "Provides hooks to fetch and update clinic team members through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exposes a minimal wrapper to access the actor and its loading state.",
  "frontend/src/hooks/useSubmissions.ts": "Provides hooks for fetching, submitting, and updating patient submissions through the actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the authenticated user's profile.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the theme and animations.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity, and global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Displays all patient submissions with search, date filtering, export, and navigation to team view.",
  "frontend/src/pages/ExamSuccessPage.tsx": "Shows a completion screen after an exam and encourages leaving a Google Maps review, with navigation back to the dashboard.",
  "frontend/src/pages/PatientFormPage.tsx": "Provides a registration form for patient info and submits a new in-progress patient submission before redirecting to success.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Shows a simple confirmation screen after patient form submission with an option to submit another response.",
  "frontend/src/pages/TeamManagementPage.tsx": "Allows team members to view and update a patient submission, extracting and editing medical fields from context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Defines project state, design goals, and required features for rebuilding a medical registration app using React, Firebase, and Internet Identity. Lists architectural notes, existing features, and access control requirements."
}