{
  "backend/main.mo": "Main Motoko actor defining the backend API with types for clinic configurations, patient submissions, professionals, and user profiles, plus authorization mixins and CRUD operations for submissions, team members, and user data.",
  "feature_evidence.json": "Feature evidence report linking two form submission debugging features to frontend files (useSubmissions.ts, PatientFormPage.tsx) with high confidence test requirements.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities with focus on patient form submission, dashboard, authentication, and error handling features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, destructive, sidebar, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for patient form, dashboard, team management, and success pages, wrapped in ThemeProvider and Toaster, with protected routes for authenticated areas.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button component with loading states, error handling, conditional visibility on patient pages, and medical-team-specific labeling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, with form validation and loading states.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that shows loading state during initialization, displays medical-team access denied screen for unauthenticated users, and renders ProfileSetupDialog for authenticated users.",
  "frontend/src/components/dashboard/DashboardFiltersBar.tsx": "Dashboard filter controls component with search input for name/room/ID and date picker for filtering submissions.",
  "frontend/src/components/dashboard/ExportButton.tsx": "Exports patient submissions to CSV format with fields like name, room, vitals, symptoms, and notes. Handles both structured personalInfo fields and legacy context parsing for backward compatibility.",
  "frontend/src/components/dashboard/SubmissionsTable.tsx": "Displays a list of patient submissions with name, room, and date, showing loading/empty states. Extracts patient data from structured fields or legacy context parsing and renders clickable cards with completion status indicators.",
  "frontend/src/components/forms/FormSectionCard.tsx": "Reusable wrapper component that renders children inside a styled card with rounded corners, shadow, and border.",
  "frontend/src/components/forms/RequiredMarker.tsx": "Renders a red asterisk (*) to indicate required form fields.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer component displaying social media links (Website, Instagram, Facebook, WhatsApp) with icons and copyright text.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, navigation toggle between Patient/Medical Team views, and login button. Shows view switcher only when authenticated.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper that combines AppHeader, main content outlet, and AppFooter in a flex column layout.",
  "frontend/src/components/team/PatientDetailsCard.tsx": "Displays comprehensive patient details including basic info, personal information, and demographics with optional WhatsApp button. Uses getPatientDetailsViewModel utility for data extraction.",
  "frontend/src/components/team/QuestionnaireResponsesSection.tsx": "Empty file (no content provided).",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with authentication, initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useClinicTeam.ts": "Provides React Query hooks for fetching and updating clinic members (getClinicMembers, updateClinicMembers) with automatic cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication with React context, providing login/logout functions and authentication status. Handles identity persistence and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Minimal query hook file that re-exports useActor functionality; most queries are now in feature-specific hook files.",
  "frontend/src/hooks/useSubmissions.ts": "Provides React Query hooks for fetching all patient submissions and submitting new patient forms, with extensive logging for debugging actor initialization and backend communication errors.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching and saving the current user's profile via the actor, with query invalidation on successful saves.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with Google Forms-inspired color palette for light/dark modes, custom animations (fadeIn, zoomIn), and base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a filterable table of all patient submissions with search and date filters, export functionality, and navigation to team page for selected submissions.",
  "frontend/src/pages/ExamSuccessPage.tsx": "Shows a success message after exam completion with an option to send results via WhatsApp to the patient using their submission data.",
  "frontend/src/pages/PatientFormPage.tsx": "Renders a patient registration form with validation for required fields (name, nationality, room number, WhatsApp) and submits structured data including personal info and medical conditions to the backend.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Displays a success confirmation page after patient form submission with a button to return to the home page for another submission.",
  "frontend/src/pages/TeamManagementPage.tsx": "Team management page for viewing and updating patient submissions with medical vitals, doctor appointments, and WhatsApp integration. Extracts patient data from structured fields or falls back to context parsing.",
  "frontend/src/utils/patientSubmissionDetails.ts": "Utility functions for creating a complete view-model of PatientSubmission details, preferring structured fields over context parsing, with helpers for formatting timestamps, bigints, and status values.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both hash-based and browser-based routing, with sessionStorage persistence for maintaining state across navigation.",
  "frontend/src/utils/whatsapp.ts": "WhatsApp integration utilities for normalizing Indonesian phone numbers and building formatted medical examination result messages with patient info, vitals, and Google Maps review links.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended shadows, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking form submission failures in PatientFormPage with two feature requests for fixing the error and adding proper error logging/validation feedback."
}