{
  "backend/main.mo": "Defines clinic configs, patient submissions, professionals, and user profiles with access control and multiple query/update methods.",
  "feature_evidence.json": "Lists feature evidence reports mapping feature IDs to impacted files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend components, pages, hooks, and styling files.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme CSS variables with global styling rules.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes wrapped in ThemeProvider and Toaster for the application.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with patient-page-specific behavior.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users to enter their name if no profile exists.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard that restricts access to authenticated users and shows an access denied screen otherwise.",
  "frontend/src/components/dashboard/DashboardFiltersBar.tsx": "Dashboard filter bar providing search and date filtering inputs with icons.",
  "frontend/src/components/dashboard/ExportButton.tsx": "Generates and downloads a CSV of submission data, using structured fields or parsing fallback text.",
  "frontend/src/components/dashboard/SubmissionsTable.tsx": "Displays a list of submissions with name, room, and date, handling loading and empty states.",
  "frontend/src/components/forms/FormSectionCard.tsx": "A styled container component for form sections.",
  "frontend/src/components/forms/RequiredMarker.tsx": "Renders a red asterisk for required fields.",
  "frontend/src/components/layout/AppFooter.tsx": "Displays the app footer with branding, year, and a referral link.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the top navigation with logo, view toggles, and login button based on authentication state.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app layout with header, footer, and routed content.",
  "frontend/src/components/team/PatientDetailsCard.tsx": "Displays detailed patient submission information with optional WhatsApp action.",
  "frontend/src/components/team/QuestionnaireResponsesSection.tsx": "Shows questionnaire responses with scores, answers, and optional feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when it changes.",
  "frontend/src/hooks/useClinicTeam.ts": "Provides hooks to fetch and update clinic member lists via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides a minimal wrapper hook returning actor and loading state from useActor.",
  "frontend/src/hooks/useSubmissions.ts": "Defines React Query hooks to fetch, submit, and update patient submissions using the actor backend.",
  "frontend/src/hooks/useUserProfile.ts": "Implements hooks to fetch and save the current user's profile via the actor with React Query caching.",
  "frontend/src/index.css": "Contains Tailwind base styles, theming variables for light/dark mode, and utility animations.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and mounts the root component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays patient submissions with filtering, export, and navigation to team pages.",
  "frontend/src/pages/ExamSuccessPage.tsx": "Shows exam completion details and offers WhatsApp result sharing for a selected patient.",
  "frontend/src/pages/PatientFormPage.tsx": "Renders the patient intake form and submits structured data to the backend.",
  "frontend/src/pages/SubmissionSuccessPage.tsx": "Shows a confirmation message after successful patient registration submission.",
  "frontend/src/pages/TeamManagementPage.tsx": "Allows medical staff to review and update a patient's submission, including WhatsApp communication.",
  "frontend/src/utils/patientSubmissionDetails.ts": "Builds a detailed view-model for PatientSubmission, combining structured fields with fallback context parsing and formatting timestamps, scores, and status.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL parameters, supporting both query strings and hash-based routing with sessionStorage persistence.",
  "frontend/src/utils/whatsapp.ts": "Normalizes phone numbers, extracts patient and medical data from structured fields or context, and generates a formatted WhatsApp message for patients.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and additional plugins.",
  "project_state.json": "Defines current project metadata, tracked features, new requests, and versioned project state information."
}