{
  "kind": "build_request",
  "title": "Show all PatientSubmission fields in Patient Details",
  "projectName": "Clinic Exam Sender",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Team Management page \"Patient Details\" card to display all available fields from the selected PatientSubmission (not just name/room/nationality/WhatsApp/symptoms), using structured fields when present and falling back to parsing detailedInfo.context only when structured fields are missing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "tampil semua data Patient Details"
        ]
      },
      "acceptanceCriteria": [
        "When a submission is selected on /team, the Patient Details section shows, at minimum: id, clinicId, patientId (if present), submissionStatus, personalInfo (fullName, country, roomNumber, whatsappNumber, medicalConditions, symptoms), demographic (age, unitOfMeasure, gestationalAge, gender), timestamps (submission/recorded/followUp where present), detailedInfo (date, time, context where present), initialScore, summary (score + status), feedbackCode (if present), notes (if present), additionalInfo (if present).",
        "For older submissions that may have missing structured personalInfo fields, the UI still shows the best-available patient details by falling back to extracting values from detailedInfo.context, without breaking the page.",
        "All user-facing labels in the expanded Patient Details view are in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Render questionnaire response data (responsesSectionA and responsesSectionB) in the Patient Details view in a readable format (e.g., tables or definition lists), including each response's scoreType, selected answer text, score, and feedbackText when present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "tampil semua data Patient Details"
        ]
      },
      "acceptanceCriteria": [
        "Patient Details includes visible sections for Section A responses and Section B responses.",
        "Each displayed response includes: scoreType (or a clear placeholder like \"N/A\"), answer.text, answer.score, and feedbackText (if present).",
        "If a section has zero responses, the UI shows a clear English empty state for that section (e.g., \"No responses recorded\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts[x], frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not change backend data models or add new backend endpoints unless required to display already-stored fields.",
    "Do not add new authentication methods beyond the existing Internet Identity flow.",
    "Do not change the patient intake form fields or submission flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}