{
  "kind": "build_request",
  "title": "Fix patient form submission failure (no data saved)",
  "projectName": "Bali Medic Care",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Fix the backend patient submission endpoint so public patient form submissions do not fail when no default clinic config exists, and ensure each saved submission receives a unique server-assigned id.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "memang sudah ada, tetapi Failed to submit form. Please try again.",
          "Error muncul saat pasien menekan tombol Submit pada form pendaftaran",
          "data tidak ada masuk, error muncul di semua perangkat",
          "perbaiki sekarang"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the patient form succeeds even when no clinic config has been created yet (no traps/exceptions).",
        "A new submission is persisted in backend storage on success.",
        "The saved submission has a unique non-zero id generated by the backend (not always 0), and the returned id matches the stored record id.",
        "The existing access rule remains: patient submission is public (no Internet Identity login required)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the patient form submission flow to use the backend-returned submission id and show an actionable error message when submission fails (including surfacing the backend error/trap reason in console logs) while keeping the current toast text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Failed to submit form. Please try again.",
          "Error muncul saat pasien menekan tombol Submit pada form pendaftaran",
          "data tidak ada masuk, error muncul di semua perangkat"
        ]
      },
      "acceptanceCriteria": [
        "On successful submit, the app navigates to /success as it does today.",
        "On failure, the user still sees the toast: \"Failed to submit form. Please try again.\"",
        "On failure, the browser console logs include the underlying error details sufficient to debug (not only a generic message).",
        "The mutation uses the backend response (Nat id) appropriately (e.g., storing/handling the returned id rather than assuming id=0)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add a minimal regression check in the medical team dashboard data flow so that newly submitted patient records can be retrieved and displayed after a successful submission (no code path relies on client-sent id=0).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "setelah pasen submit data, data langsung masuk ke Medical Team",
          "data tidak ada masuk, error muncul di semua perangkat"
        ]
      },
      "acceptanceCriteria": [
        "After a successful patient submission, an authenticated medical team user can open /dashboard and see the new submission listed.",
        "Selecting the new submission from the table navigates to /team with the correct submissionId parameter (non-zero, matching the saved submission)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep logic in backend/main.mo.",
    "Do not require Internet Identity login for the patient registration form flow.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text changes."
  ],
  "nonGoals": [
    "Adding real-time notifications, auto-refresh, or push alerts for new submissions.",
    "Introducing new backend services, external databases, or non-Motoko backend code.",
    "Redesigning the patient form fields or changing the existing form structure beyond what is needed to fix submission reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}