{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix patient form submission flow to use backend id and improve dashboard retrieval robustness",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Use backend-returned submission id in the patient form flow and improve failure diagnostics while keeping the existing English toast text.",
      "acceptanceCriteria": [
        "On successful submit, the app navigates to /success as it does today.",
        "On failure, the user still sees the toast: \"Failed to submit form. Please try again.\"",
        "On failure, the browser console logs include the underlying error details sufficient to debug (not only a generic message).",
        "The mutation uses the backend response (Nat id) appropriately (e.g., storing/handling the returned id rather than assuming id=0)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PatientFormPage.tsx",
          "operation": "modify",
          "description": "Capture the bigint submission id returned by the backend call, validate it is non-zero, and log it for traceability before navigating to /success; on errors, keep the existing English toast text while expanding console logging to include raw error objects and any nested/cause details (to surface backend trap reasons)."
        },
        {
          "path": "frontend/src/hooks/useSubmissions.ts",
          "operation": "modify",
          "description": "Type and document the submit mutation return value as the backend-returned bigint id, ensuring callers can rely on the response; keep query invalidation on success and avoid any client-side assumptions that the id is 0."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add a minimal regression check to ensure the dashboard retrieves and displays newly submitted records and navigation uses the backend id (not a client-sent placeholder).",
      "acceptanceCriteria": [
        "After a successful patient submission, an authenticated medical team user can open /dashboard and see the new submission listed.",
        "Selecting the new submission from the table navigates to /team with the correct submissionId parameter (non-zero, matching the saved submission)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSubmissions.ts",
          "operation": "modify",
          "description": "Adjust the dashboard submissions query behavior to reliably refetch when the dashboard is opened (e.g., ensure refetch-on-mount/short staleness) so newly created submissions are retrieved without requiring any client-generated id assumptions."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add a minimal runtime regression check in the dashboard data flow: warn in the console if any retrieved submission has id=0, and ensure selection/navigation continues to use the backend-provided submission.id when navigating to /team."
        },
        {
          "path": "frontend/src/components/dashboard/SubmissionsTable.tsx",
          "operation": "modify",
          "description": "Harden rendering expectations around ids by ensuring list keys and click-selection operate on submission.id.toString() and optionally emitting a console warning if a submission with id=0 is encountered (without changing user-facing text)."
        }
      ]
    }
  ]
}