{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clinic Exam Sender — Expand Patient Details to show full PatientSubmission fields and questionnaire responses",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Expand the /team Patient Details card to display all available PatientSubmission fields with structured-first rendering and safe fallback parsing from detailedInfo.context when structured fields are missing.",
      "acceptanceCriteria": [
        "When a submission is selected on /team, the Patient Details section shows, at minimum: id, clinicId, patientId (if present), submissionStatus, personalInfo (fullName, country, roomNumber, whatsappNumber, medicalConditions, symptoms), demographic (age, unitOfMeasure, gestationalAge, gender), timestamps (submission/recorded/followUp where present), detailedInfo (date, time, context where present), initialScore, summary (score + status), feedbackCode (if present), notes (if present), additionalInfo (if present).",
        "For older submissions that may have missing structured personalInfo fields, the UI still shows the best-available patient details by falling back to extracting values from detailedInfo.context, without breaking the page.",
        "All user-facing labels in the expanded Patient Details view are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/patientSubmissionDetails.ts",
          "operation": "create",
          "description": "Add display-focused helpers to derive a complete, best-available Patient Details view-model from a PatientSubmission: prefer structured fields (personalInfo/demographic/timestamps/etc.) and safely fall back to parsing detailedInfo.context only for missing values; include defensive parsing/formatting (bigint to string, optional timestamps) to prevent runtime errors."
        },
        {
          "path": "frontend/src/components/team/PatientDetailsCard.tsx",
          "operation": "create",
          "description": "Create a composed PatientDetailsCard component to render the full PatientSubmission details using readable structured layouts (e.g., definition lists/sections) and English labels; consume the view-model from frontend/src/utils/patientSubmissionDetails.ts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TeamManagementPage.tsx",
          "operation": "modify",
          "description": "Replace/extend the current inline Patient Details UI to use PatientDetailsCard and show all required fields (id/clinicId/patientId/submissionStatus/personalInfo/demographic/timestamps/detailedInfo/initialScore/summary/feedbackCode/notes/additionalInfo); keep existing WhatsApp button behavior and ensure fallback parsing is only used when structured fields are missing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render responsesSectionA and responsesSectionB in Patient Details with readable per-response fields and clear empty states.",
      "acceptanceCriteria": [
        "Patient Details includes visible sections for Section A responses and Section B responses.",
        "Each displayed response includes: scoreType (or a clear placeholder like \"N/A\"), answer.text, answer.score, and feedbackText (if present).",
        "If a section has zero responses, the UI shows a clear English empty state for that section (e.g., \"No responses recorded\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/team/QuestionnaireResponsesSection.tsx",
          "operation": "create",
          "description": "Create a QuestionnaireResponsesSection component that renders a section title (Section A / Section B) and a readable list/table/definition-list of QuestionResponse items showing scoreType (or \"N/A\"), answer.text, answer.score, and feedbackText when present; include an English empty state when no responses exist. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/team/PatientDetailsCard.tsx",
          "operation": "modify",
          "description": "Integrate QuestionnaireResponsesSection into the expanded Patient Details rendering to display responsesSectionA and responsesSectionB under clearly labeled subsections with the required fields and empty states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TeamManagementPage.tsx",
          "operation": "modify",
          "description": "Wire the updated PatientDetailsCard (now including questionnaire responses sections) into the /team page so that selecting a submission reliably shows both Section A and Section B responses (or English empty states) in Patient Details."
        }
      ]
    }
  ]
}